Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/N12B.tmx
Source language: en_us
Languages: zh_cn

source: Hokkaido Green
zh_cn: 北海道绿

source: After his brother died, Hitoshi Watanabe quit his job and decided to walk to the hot spring waterfall at the end of the world.
zh_cn: 他兄弟去世后，渡边仁（Hitoshi Watanabe）就辞了职，决定步行到世界尽头的温泉瀑布。

source: His friends told him he was crazy. "You're fifty-three years old. You're not going to get another job."
zh_cn: 他的朋友们说他疯了，“你五十三岁了，你不会再得到另一份工作了。”

source: "My brother died of overwork," Hitoshi answered. "I don't want that to happen to me."
zh_cn: “我兄弟是过劳死的，”仁回答说，“我不希望这样的事发生在我身上。”

source: He packed a bag with a few clothes, a sleeping bag, his camera equipment, and his father's photo album and set out on foot from Osaka.
zh_cn: 他将几件衣服、一个睡袋、他的照相器材和他父亲的相册装进一个包，然后从大阪步行出发了。

source: The journey would have taken a few hours in a plane, but a pilgrimage demanded a journey on foot.
zh_cn: 这趟旅程坐飞机要用几个小时，但朝圣者追求的是用脚走的旅程。

source: After two months he reached the edge of Honshu and took a ferry to Hokkaido.
zh_cn: 两个月后他到达了本州岛（Honshū）的边上，然后乘坐渡船到北海道。

source: He continued walking towards Shiretoko, the peninsula in the island's northeast.
zh_cn: 他继续走向知床（Shiretoko），这个岛东北的半岛。

source: It was summer, and he filled his camera's memory cards with photos of green meadows and fields of lavender.
zh_cn: 现在是夏天了，他在照相机的内存卡上存满了绿色草地和熏衣草田的照片。

source: Shiretoko's original inhabitants, the Ainu, had referred to the peninsula as the end of the world.
zh_cn: 知床的原住民阿伊努人把这个半岛看作是世界的尽头。

source: Hitoshi's father had told him it was where secrets went to hide.
zh_cn: 仁的父亲告诉过他，秘密就是藏到这里来的。

source: Hitoshi had always wanted to visit, but the demands of work meant he had never managed to find the time.
zh_cn: 仁一直想来看看，但工作的需要使他从未抽出过时间。

source: When he finally reached the national park, he waited until dark and then walked down the path leading through the woods to the hot spring waterfall.
zh_cn: 当他最终到达国家公园时，他等到天黑，然后沿着那条穿过树林的小路走向温泉瀑布。

source: The park was closed for the day, but it was easy to bypass the gate.
zh_cn: 公园这一天已经关了，但绕过大门还是很容易的。

source: His flashlight illuminated a sign hanging from a rope stretched across the trail:
zh_cn: 他的手电筒照亮了横拉过小径的一条绳子上挂着的一个标牌：

source: Closed due to bear sightings.
zh_cn: 有熊出没，此处关闭。

source: Did bears come out at night?
zh_cn: 熊在晚上出来吗？

source: Still, he had come this far.
zh_cn: 尽管如此，他已经走了这么远了。

source: He slipped under the rope and continued down the path.
zh_cn: 他从绳子下面溜了过去，继续沿着那条路走。

source: The sound of running water came from ahead.
zh_cn: 奔流的水声从前面传来。

source: The trail emerged from the woods and he looked up at the side of a rocky hill.
zh_cn: 小径从树林中钻了出去，他抬头看向一座石山的侧面。

source: A narrow waterfall trickled down the side of the rock, splashing into a pool of water.
zh_cn: 一道窄窄的瀑布从石头的边缘流淌而下，溅入一个水池。

source: His father claimed the water here was the most amazing color he'd ever seen- a vivid blue-green he'd dubbed Hokkaido green.
zh_cn: 他父亲声称这里的水是他见过的最令人惊异的颜色——一种他称之为北海道绿的鲜艳的蓝绿色。

source: The water looked inviting, but since it was dark, it was hard to judge the color.
zh_cn: 这水看起来很诱人，但因为天黑了，难以判断颜色。

source: He undressed and stepped into the pool.
zh_cn: 他脱下衣服，迈入池中。

source: The water was warm and he let its soothing touch wash over his body.
zh_cn: 水是暖的，他让它舒缓的触摸泼洒在他身上。

source: He caught a glimpse of his reflection in the moonlight.
zh_cn: 他瞥见自己在月光下的倒影。

source: He hardly recognized the gray-haired salaryman who peered back at him, a cubicle samurai who had devoted his life to doing the bidding of his corporate overlords.
zh_cn: 他几乎认不出那个回望他的花白头发的工薪族，一个终其一生遵照公司领导的吩咐做事的格子间武士。

source: A cluster of specks of light appeared near the edge of the woods.
zh_cn: 一簇星星点点的光亮出现在离树林边缘不远的地方。

source: Had the park rangers noticed his presence?
zh_cn: 公园巡逻员发现他了？

source: A brown bear entered the clearing.
zh_cn: 一头棕熊走进了这块空地。

source: It walked upright and carried an old-fashioned miner's lantern filled with fireflies.
zh_cn: 它直立行走，提着一个装有萤火虫的老式矿工灯笼。

source: It waddled towards the pool, looking less like a predator than like an elderly sumo wrestler tottering uncertainly towards a bout with a reigning champion.
zh_cn: 它摇摇摆摆地走向水池，看起来不像是一个食肉动物，而更像是一个年老的相扑选手蹒跚地走向和卫冕冠军的一场较量。

source: It stopped near the edge of the pool and bowed.
zh_cn: 它在水池边附近停下，然后弯腰鞠躬。

source: It would have been impolite not to return the gesture, so Hitoshi stood up and bowed as well.
zh_cn: 不回礼是不礼貌的，所以仁站起来，也鞠了一躬。

source: The bear stooped down and put the lantern on the ground.
zh_cn: 熊弯下身来，把灯笼放在地上。

source: It fumbled with the straps on Hitoshi's pack and started rummaging through the contents.
zh_cn: 它笨手笨脚地摸索仁背包上的带子，然后开始翻找里面的东西。

source: "I have some tinned tuna," Hitoshi said.
zh_cn: “我有一些罐装金枪鱼，”仁说。

source: The bear ignored him and continued to search through the pack.
zh_cn: 熊不理他，继续在背包里搜寻。

source: It took out his cell phone and tapped awkwardly on the screen.
zh_cn: 它拿出他的手机，笨拙地在屏幕上轻轻敲击。

source: It walked to the edge of the pool and held out the phone.
zh_cn: 它走到水池边上，把手机伸过来。

source: Hitoshi leaned closer to see the screen.
zh_cn: 仁倾身靠近些看屏幕。

source: The bear had written a message in hiragana. Hello.
zh_cn: 熊用平假名写了一条信息：你好。

source: "Hello," he said uncertainly.
zh_cn: “你好，”他迟疑地说。

source: Sorry I use hiragana. I never study kanji.
zh_cn: 抱歉我用平假名，我从没学过日文汉字。

source: "That's okay. Can you talk?"
zh_cn: “没关系，你会说话吗？”

source: Bears cant talk.
zh_cn: 熊不会说话。

source: The bear put the phone to the side and eased itself into the hot spring.
zh_cn: 熊将手机放到一边，然后悠闲地泡进温泉。

source: The bear had dark eyes, and its scraggly brown fur was dotted with patches of gray.
zh_cn: 这头熊有黑色的眼睛，它蓬乱的棕色皮毛上点缀着灰色斑点。

source: The two of them sat in silence for a couple of minutes.
zh_cn: 他们两个静静地坐了几分钟。

source: Then the bear leaned over the edge of the hot spring and grasped the phone.
zh_cn: 然后熊俯身越过温泉边沿，抓住手机。

source: How can I help? it wrote.
zh_cn: 我能帮什么忙吗？它写道。

source: "What do you mean?"
zh_cn: “你什么意思？”

source: You look for secret?
zh_cn: 你在寻找秘密？

source: "How do you know that?" Hitoshi asked.
zh_cn: “你怎么知道的？”仁问。

source: The bear tapped its nose.
zh_cn: 熊点点自己的鼻子。

source: You smell like man looking for secret.
zh_cn: 你闻起来像是寻找秘密的人。

source: Hitoshi took a moment to compose his thoughts.
zh_cn: 仁用了一会儿时间组织自己的思想。

source: "When I was a boy I used to listen to my parents talk with customers in their ramen restaurant.
zh_cn: “在我还是一个男孩时，我常常听我父母在他们的拉面馆里跟顾客谈话。

source: We lived in a small town and most of my friends were expected to take over their family businesses."
zh_cn: 我们住在一个小镇上，我的大部分朋友们都被期望接手他们的家族生意。”

source: Hitoshi's father had been a giant of a man with bushy eyebrows and shaggy hair.
zh_cn: 仁的父亲是个身材高大的人，长着浓密的眉毛和粗乱的头发。

source: "I'll be happy if you work in the restaurant after you graduate from high school," he had said to Hitoshi and his brother.
zh_cn: “如果你们高中毕业后到餐馆工作我会很高兴的，”他曾对仁和他兄弟说。

source: "But I don't expect it.
zh_cn: “但我并不要求你们这么做。

source: You're both smart boys.
zh_cn: 你们两个都是聪明的男孩。

source: If you want to get a job in the city, that will make me proud too."
zh_cn: 如果你们想在城里找份工作，那也让我很自豪。”

source: Hitoshi glanced across at the bear. It seemed to be listening intently.
zh_cn: 仁匆匆看了一眼熊，它好像在专心地听。

source: "My brother and I moved to Osaka for university.
zh_cn: “我兄弟和我到大阪上大学。

source: We both got jobs with big companies.
zh_cn: 我们两个都在大公司找到了工作。

source: I developed image processing software for a camera manufacturer.
zh_cn: 我为一家照相机生产商开发图像处理软件。

source: Two years ago my father called me."
zh_cn: 两年前我父亲打电话给我。”

source: Hitoshi's mother had died a year earlier and his father had sounded old and tired.
zh_cn: 仁的母亲在前一年去世了，他父亲听上去苍老而疲惫。

source: "I'd like you to come and visit, Hitoshi.
zh_cn: “我希望你来看看，仁。

source: I want to teach you how to cook tonkotsu ramen. It's my best dish."
zh_cn: 我想教你做豚骨拉面，那是我最拿手的饭菜。”

source: "I'm sorry, but things are really busy at work.
zh_cn: “对不起，但是工作上的事情实在很忙。

source: We have a new camera due to start production next month."
zh_cn: 我们有一款新的照相机预计下个月开始生产。”

source: "It's good to work hard, Hitoshi.
zh_cn: “努力工作是很好，仁。

source: Your mother and I always worked hard at the restaurant.
zh_cn: 你母亲和我总是在餐馆努力工作。

source: But every once in a while if the weather was nice, we'd close the restaurant.
zh_cn: 但每隔一段时间，如果天气不错，我们会关掉餐馆。

source: Your mother would go for a bicycle ride and I would go fishing."
zh_cn: 你母亲会去骑自行车，而我则会去钓鱼。”

source: "I have an important job, Father.
zh_cn: “我有一份很重要的工作，父亲。

source: My colleagues depend on me.
zh_cn: 我的同事们都指望我。

source: I'll be home next month for New Year's."
zh_cn: 我下个月会回家过新年。”

source: Hitoshi was going to say goodbye, but his father cleared his throat.
zh_cn: 仁正要说再见，可是他父亲清了清嗓子。

source: "Have you started making black and white cameras yet?"
zh_cn: “你们开始制作黑白照相机了吗？”

source: Hitoshi sighed.
zh_cn: 仁叹了口气。

source: His father had been a talented photographer but refused to use anything except black and white film.
zh_cn: 他父亲是个有才华的摄影师，但除了黑白胶卷外拒绝使用其他任何东西。

source: "I've told you before," Hitoshi said. "Cameras are digital now.
zh_cn: “我以前跟你说过，”仁说，“照相机现在是数码的了。

source: You can change the settings so the photos are color or black and white."
zh_cn: 你可以更改设置，把照片设成彩色或者黑白。”

source: "Colors are like dreams," his father replied. "If you try and reproduce them, you'll only be disappointed."
zh_cn: “色彩像梦，”他父亲回答说，“如果你试着复制它们，你只会失望。”

source: Hitoshi looked across at the bear. "My father died a week later."
zh_cn: 仁看向熊，“我父亲一周后去世了。”

source: Sorry.
zh_cn: 很遗憾。

source: "My brother died this year.
zh_cn: “我兄弟今年去世了。

source: I don't have any family left now."
zh_cn: 我现在没有什么家人了。”

source: He scooped up some of the water and let it run through his fingers.
zh_cn: 他掬起一些水，让它流过他的手指。

source: "I want to know my parents' recipe for tonkotsu ramen," he said.
zh_cn: “我想知道我父母做豚骨拉面的食谱，”他说。

source: Restaurant is hard work.
zh_cn: 开餐馆很辛苦的。

source: "I know, but I'll be the boss.
zh_cn: “我知道，但我将是老板。

source: If I want to close the restaurant for a day, I can."
zh_cn: 如果我想把餐馆关上一天，我就可以关。”

source: Good for customers?
zh_cn: 顾客这方面行吗？

source: "My parents' tonkotsu ramen was the best.
zh_cn: “我父母的豚骨拉面是最好的。

source: People used to come from other towns just to eat it.
zh_cn: 人们以前常常从其他城镇过来就是为了吃这个面。

source: Can you find the secret of how to make it?"
zh_cn: 你能找到如何制作的秘密吗？”

source: I can sniff out secret.
zh_cn: 我能闻出秘密。

source: But you give me something.
zh_cn: 但你要给我些东西。

source: "What?"
zh_cn: “什么？”

source: The bear didn't answer.
zh_cn: 熊没有回答。

source: "The tuna?"Hitoshi asked.
zh_cn: “金枪鱼？”仁问。

source: The bear shook its head.
zh_cn: 熊摇摇头。

source: Photos.
zh_cn: 照片。

source: "My father's photo album?"
zh_cn: “我父亲的相册？”

source: Not just album.
zh_cn: 不仅仅是相册。

source: All photos.
zh_cn: 所有的照片。

source: You won't be able to take any more photos.
zh_cn: 你不能够再拍照了。

source: Cameras no longer work for you.
zh_cn: 照相机不再为你工作了。

source: Photos and memories were all he had left of his family.
zh_cn: 照片和回忆是他仅留的与家人有关的一切。

source: "Why do you want my photos?"
zh_cn: “你为什么想要我的照片？”

source: Every action creates opportunities. Every action limits your choices.
zh_cn: 每一个行动都创造机会，每一个行动都限制你的选择。

source: Hitoshi waited for the bear to explain more, but it had stopped writing.
zh_cn: 仁等着熊再解释多一些，但它停下不写了。

source: "Is there anything else I can give you?"
zh_cn: “我可以给你其他东西吗？”

source: "I don't mean to be rude, but I hope you're not going to tell me that to find the secret I have to look within myself or something like that.
zh_cn: “我不是有意冒犯，但我希望你不要告诉我，要找到这个秘密我必须得审视自我或类似那样的东西。

source: I'd prefer something more practical. Like the exact recipe."
zh_cn: 我更喜欢比较实际的东西，比如确切的食谱。”
